app/controllers/foods_controller.rb

  def compare
    @foods_id = Food.where(name: params[:foodName]).pluck(:id)
    @foods_id.each do |f|
      @meals_id = Ingredient.where(food_id: f).pluck(:meal_id)
      @meals_id.uniq
    end
    meal = []
    @meals_id.each do |meal_id|
      if((Meal.find(meal_id).ingredients.map.pluck(:food_id) - @foods_id).empty?)
        meal << Meal.find(meal_id)
---
SELECT "foods"."id" FROM "foods" WHERE "foods"."name" IN ('patatas', 'huevos')
SELECT  "foods".* FROM "foods" ORDER BY "foods"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "ingredients"."meal_id" FROM "ingredients" WHERE "ingredients"."food_id" = $1  [["food_id", 12]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 96], ["LIMIT", 1]]
SELECT "meals"."name" FROM "meals" WHERE "meals"."id" = $1  [["id", 16]]
SELECT COUNT(*) FROM "foods" WHERE "foods"."name" IN ('tomates', 'cebolla', 'huevos', 'patatas')
SELECT COUNT(*) FROM "ingredients" WHERE "ingredients"."meal_id" = $1  [["meal_id", 16]]
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def recipe
    @meal = Meal.find_by(id: params[:id])
---
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def index
    @foods = Food.all
---
SELECT "foods".* FROM "foods" WHERE (name ilike '%pata%') ORDER BY name

  def create
    @food = Food.new(food_params)
    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", 2016-09-23 12:10:13 UTC], ["updated_at", 2016-09-23 12:10:13 UTC]]

  def destroy
    @food.destroy
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 23]]

    def set_food
      @food = Food.find(params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]